# GetRelativeDisplacement Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementElement..::..GetRelativeDisplacement Method
DisplacementElement Class See Also
---
The relative displacement applied to the displaced elements by this DisplacementElement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public XYZ GetRelativeDisplacement()
```

Visual Basic
---
```text
Public Function GetRelativeDisplacement As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetRelativeDisplacement()
```

# ### Return Value
The relative displacement.
# See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace